/******************************************************************************
Write a C++ program to find the area of any triangle using Heron's formula.
*******************************************************************************/
#include <iostream>
/*Χρησιμοποιείται αυτή η κεφαλίδα, επειδη θα χρησιμοποιήσουμε την συνάρτηση της scrt() και την Fabs()*/
#include<cmath>
using namespace std;
int main()
{
    float a,b,c,t,riziko,emvadon,apoluti_timi;
    /*Δομή*/cout<<endl<<"Δώσε μου το μήκος της πλευράς α, δεν μπορείς να μου δώσεις αρνήτικο αριθμό."<<endl;
    cin>>a;
    while (a<0)/*Χρήση της δομής επανάληψης της while*/
    {
       cout<<endl<<"Δώσε μου το μήκος της πλευράς α, δεν μπορείς να μου δώσεις αρνήτικο αριθμό."<<endl;
       cout<<endl;
       cin>>a;/*ΠΡΟΣΟΣΧΗ ΑΝ δεν δώσουμε στον χρήστη την δύνατοτητα να είσαγεί εκ νέου την τιμή, η δομή θα επαναλαμβάνεται επ'απείρον*/
       cout<<endl<<"Οσό μου δίνεις αρνήτικο αριθμό, η επιλόγη να μου δώσεις έναν αριθμό ως μήκος θα επαναλαμβάνεται.";
    } /*Δομή*/
    cout<<endl<<"ο αριθμός που μου έδωσες για το μήκος της πλευράς α είναι."<<endl<<"α="<<a;
    /*Χρήση της δομής επανάληψης της while για την πλευρά β*/
   /*Δομή*/cout<<endl<<"Δώσε μου το μήκος της πλευράς β, δεν μπορείς να μου δώσεις αρνήτικο αριθμό."<<endl;
    cin>>b;
    while (b<0)/*Χρήση της δομής επανάληψης της while*/
    {
       cout<<endl<<"Δώσε μου το μήκος της πλευράς β, δεν μπορείς να μου δώσεις αρνήτικο αριθμό."<<endl;
       cout<<endl;
       cin>>b;/*ΠΡΟΣΟΣΧΗ ΑΝ δεν δώσουμε στον χρήστη την δύνατοτητα να είσαγεί εκ νέου την τιμή, η δομή θα επαναλαμβάνεται επ'απείρον*/
       cout<<endl<<"Οσό μου δίνεις αρνήτικο αριθμό, η επιλόγη να μου δώσεις έναν αριθμό ως μήκος θα επαναλαμβάνεται.";
    } /*Δομή*/
    cout<<endl<<"ο αριθμός που μου έδωσες για το μήκος της πλευράς β είναι."<<endl<<"β="<<b;
    /*Χρήση της δομής επανάληψης της while για την πλευρά γ*/
   /*Δομή*/cout<<endl<<"Δώσε μου το μήκος της πλευράς γ, δεν μπορείς να μου δώσεις αρνήτικο αριθμό."<<endl;
    cin>>c;
    while (c<0)/*Χρήση της δομής επανάληψης της while*/
    {
       cout<<endl<<"Δώσε μου το μήκος της πλευράς γ, δεν μπορείς να μου δώσεις αρνήτικο αριθμό."<<endl;
       cout<<endl;
       cin>>c;/*ΠΡΟΣΟΣΧΗ ΑΝ δεν δώσουμε στον χρήστη την δύνατοτητα να είσαγεί εκ νέου την τιμή, η δομή θα επαναλαμβάνεται επ'απείρον*/
       cout<<endl<<"Οσό μου δίνεις αρνήτικο αριθμό, η επιλόγη να μου δώσεις έναν αριθμό ως μήκος θα επαναλαμβάνεται.";
    } /*Δομή*/
    cout<<endl<<"ο αριθμός που μου έδωσες για το μήκος της πλευράς γ είναι."<<endl<<"γ="<<c;
    cout<<endl;
    /*Βλέπουμε ότι η δομή της While για να πάρουμε δεδομένα απο τον χρήστη, επαναλαμβάνετε ήδη τρείς φόρες και το πρόγραμμά
    αυτό είναι πάρα, μα πάρα πολύ μικρό. Δεν είναι όρθό να επαναλαμβάνονται οι δόμες επαναλήψης σε αυτόν τον βαθμό για ένα πρόγραμμά
    αυτής της κλίμακας*/
    /*Υπολογίσμος της ημιπερίμετρού*/
    /*Η τιμή της παράστασης που είναι μέσα στο ρίζικο δεν μπορεί να έχει αρνήτικη τιμή*/
    /*Το εμβαδόν ΄ποσο δεν μπορεί να είναι αρνήτικο. Για να μην είναι αρνητίκο, πρ΄επει η ημιπερίμετρός να είναι μεγαλύτερη απο τη
    εκάστοτε πλευρά του τριγώνου-τουλάχιστον σε αυτό το σημειο και για να το καταφέρουμε αυτό.Πρέπει οπωσδήποτε να δημιουργήσουμε
    δόμες επανάληψης και ελεγχών.ΑΛΛΑ!!!!! αντί να κάνουμε όλον αυτόν τον κόπο, μπορούμε να χρησιμοποιήσουμε την συναρτήση Fabs()
    η οποία μας δίνει την απόλυτη τιμή, ενός πραγματίκου αριθμού.Σε αντίθεση με την Abs() η οποία μας δίνει την απόλυτη τιμή ενός
    ακέραιου αρίθμου.*/
    t=(a+b+c)/2;
    cout<<endl<<"Η ημιπερίμετρος είναι τ="<<t;
    /*Αν η ημιπερίμετρός είναι ίση με κάποια απο τις πλευρές του τριγώνου τότε το αποτέλεσμα θα είναι 0
    οπότε λέμε, μέσω μία δομής επάναλήψης.*/
    while ((t==a)||(t==b)||(t==c))
    {
        cout<<endl<<"επείδη η ημιπερίμετρος είναι ίση με μία απο τις πλευρές που δόθηκαν, παρακάλω δώστε εκ νέου τιμές για τις πλευρές";
        /*Υπολογίσμος της παράστασης μέσα στο ρίζικο*/
        cout<<endl<<"δώσε μου διαδοχίκα τις νέες τίμες για τις πλευρές του τριγώνου"; 
        cin>>a>>b>>c;
        t=(a+b+c)/2;
        cout<<"η νέα ημιπερίμετρός είναι="<<t;
    }
    riziko=(t*(t-a)*(t-b)*(t-c));
    cout<<endl<<"η τιμή που έχει η παράσταση μέσα στο ρίζικο είναι="<<riziko;
    /*Για να μην γίνει καμία χαζομάρα, παιρνούμε το αποτέλεσμα απο το riziko και το βάζουμε σε μία απόλυτη τιμή(fabs())*/
    apoluti_timi=fabs(riziko);
    cout<<endl;
    emvadon=sqrt(apoluti_timi);
    cout<<"Το εμβαδόν του τρίγώνου είναι Ε="<<emvadon;
    return 0;
}

